README.org
#+title: Doom Emacs Configuration
#+author: Vedant "cupkax" Sansare
#+startup: fold
#+property: header-args:emacs-lisp :tangle "config.el" :results silent
#+property: header-args :tangle no :results silent

* Doom Core
** =init.el=
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:
#+name: init.el
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :comments none
;;; init.el -*- lexical-binding: t; -*-
(doom!
 :completion
 <<doom-completion>>

 :ui
 <<doom-ui>>

 :editor
 <<doom-editor>>

 :emacs
 <<doom-emacs>>

 :term
 <<doom-term>>

 :checkers
 <<doom-checkers>>

 :tools
 <<doom-tools>>

 :os
 <<doom-os>>

 :lang
 <<doom-lang>>

 :email
 <<doom-email>>

 :app
 <<doom-app>>

 :config
 <<doom-config>>
 )
#+end_src

*** doom-completion
#+name: doom-completion
#+begin_src emacs-lisp
(company
 +childframe)
(ivy
 +prescient
 +icons
 +fuzzy)
#+end_src
*** doom-ui
#+name: doom-ui
#+begin_src emacs-lisp
deft
doom
doom-dashboard
doom-quit
hl-todo
hydra
(ligatures
 +extra)
modeline
nav-flash
ophints
(popup
 +all
 +defaults)
treemacs
vc-gutter
vi-tilde-fringe
(window-select
 +numbers)
workspaces
zen
#+end_src
*** doom-editor
#+name: doom-editor
#+begin_src emacs-lisp
(evil
 +everywhere)
file-templates
fold
(format
 +onsave)
rotate-text
snippets
;;word-wrap
#+end_src
*** doom-emacs
#+name: doom-emacs
#+begin_src emacs-lisp
(dired
 +icons)
electric
(ibuffer +icons)
(undo +tree)
vc
#+end_src
*** doom-term
#+name: doom-term
#+begin_src emacs-lisp
;;vterm
#+end_src
*** doom-checkers
#+name: doom-checkers
#+begin_src emacs-lisp
syntax
;spell
;grammar
#+end_src
*** doom-tools
#+name: doom-tools
#+begin_src emacs-lisp
(eval
 +overlay)
gist
(lookup
 +offline
 +dictionary
 +docsets)
lsp
magit
make
pdf
rgb
#+end_src
*** doom-os
#+name: doom-os
#+begin_src emacs-lisp
#+end_src
*** doom-lang
#+name: doom-lang
#+begin_src emacs-lisp
(csharp
 +lsp
 +unity)
data
emacs-lisp
(json
 +lsp)
(javascript
 +lsp)
ledger
lua
markdown
(org
 +dragndrop
 +gnuplot
 +hugo
 +noter
 +pandoc
 +pretty
 +roam)
(python
 +poetry
 +lsp
 +pyright)
(sh
 +powershell)
web
(yaml
 +lsp)
#+end_src
*** doom-email
#+name: doom-email
#+begin_src emacs-lisp
#+end_src
*** doom-app
#+name: doom-app
#+begin_src emacs-lisp
#+end_src
*** doom-config
#+name: doom-config
#+begin_src emacs-lisp
(default
  +bindings
  +smartparens)
#+end_src

** =package.el=
:PROPERTIES:
:header-args:emacs-lisp: :tangle "packages.el" :comments no
:END:
*** Prevent Byte Compile
#+begin_src emacs-lisp
;; -*- no-byte-compile: t; -*-
#+end_src
*** Aesthetics
**** Dired Icons
#+begin_src emacs-lisp
(package! all-the-icons-dired)
#+end_src
**** Evil Better Visual Line
#+begin_src emacs-lisp
(package! evil-better-visual-line)
#+end_src
**** Info Colors
#+begin_src emacs-lisp
(package! info-colors )
#+end_src

*** Keybindings
#+begin_src emacs-lisp
(package! general)
#+end_src
*** Org
/Head/ for Development
#+begin_src emacs-lisp
(unpin! org-mode)
#+end_src
**** Visuals
***** Tables
#+begin_src emacs-lisp
(package! org-pretty-table-mode
  :recipe (:host github
           :repo "Fuco1/org-pretty-table"))
#+end_src
***** Tags
#+begin_src emacs-lisp
(package! org-pretty-tags)
#+end_src

***** Priorities
#+begin_src emacs-lisp
(package! org-fancy-priorities)
#+end_src
**** Org Capture
#+begin_src emacs-lisp
(package! doct)
#+end_src
**** Org Download
#+begin_src emacs-lisp
(package! org-download
  :recipe (:host github
            :repo "abo-abo/org-download"))
#+end_src

**** Org Helm Rifle
#+begin_src emacs-lisp
(package! helm-org-rifle)
#+end_src

**** Org Mindmap
#+begin_src emacs-lisp
(package! org-mind-map
  :recipe (:host github
            :repo "theodorewiles/org-mind-map"))
#+end_src
**** Org Noter
#+begin_src emacs-lisp
(package! org-noter)
#+end_src
**** Org Pandoc
#+begin_src emacs-lisp
(package! ox-pandoc)
#+end_src
**** Org Protocol
#+begin_src emacs-lisp
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
#+end_src
**** Org Ref
#+begin_src emacs-lisp
(package! org-ref)
#+end_src
**** Org Roam
***** Org Roam Bibtex
#+begin_src emacs-lisp
(package! org-roam-bibtex)
#+end_src
***** Org Roam Server
#+begin_src emacs-lisp
(package! org-roam-server)
#+end_src
**** Org Super Agenda
#+begin_src emacs-lisp
(package! org-super-agenda)
#+end_src
* Doom Config
** Lexical Bindings
#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src

** Personal Information
#+begin_src emacs-lisp
(setq user-full-name "Vedant Sansare (cupkax)"
      user-mail-address "vedantsansare23@gmail.com")
#+end_src

** Startup
*** Better Defaults
#+begin_src emacs-lisp
(setq undo-limit 80000000)
(setq evil-want-fine-undo t)
(setq auto-save-default t)
(setq global-subword-mode 1)
#+end_src
*** =custom.el=
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

*** =utf-8-unix= System
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

(prefer-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8)
#+end_src

** Visual Settings
*** Fonts
#+begin_src emacs-lisp
(setq doom-font                (font-spec :family "FiraCode Nerd Font" :size 16))
(setq doom-big-font            (font-spec :family "FiraCode Nerd Font" :size 20))
(setq doom-variable-pitch-font (font-spec :family "Overpass Nerd Font" :size 16))
(setq doom-serif-font          (font-spec :family "BlexMono Nerd Font" :weight 'light))
#+end_src

*** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-palenight)
#+end_src

*** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
*** Modeline
**** Change red text
#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "grey"))
#+end_src

**** Show time
#+begin_src emacs-lisp
(setq display-time-24hr-format t)
(display-time-mode 1)
#+end_src
**** TODO Debug
#+begin_src emacs-lisp
(custom-set-faces! '(doom-modeline-evil-insert-state :weight bold :foreground "#339CDB"))
#+end_src
*** Info Colors
#+begin_src emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)

(add-hook 'Info-mode-hook #'mixed-pitch-mode)
#+end_src

** Keybindings
*** Change local leader
#+begin_src emacs-lisp
(setq doom-localleader-key ",")
#+end_src

*** General
**** Initial Config
#+begin_src emacs-lisp
(use-package! general)
(defconst my-leader "SPC")
(general-create-definer my-leader-def
  :prefix my-leader)

(general-create-definer my-local-leader-def
  :prefix my-local-leader
  :prefix ",")
#+end_src
**** Evil Setup and Error Handling
#+begin_src emacs-lisp
(general-evil-setup t)
(general-auto-unbind-keys)
#+end_src
*** Which-key
**** Key delay
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.0)
#+end_src

**** Replace =evil= with unicode symbols
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))
#+end_src

** Navigation
*** Deft
#+begin_src emacs-lisp
(use-package deft
      :after org
      :config
      (setq deft-recursive t)
      (setq deft-use-filter-string-for-filename t)
      (setq deft-default-extension "org")
      (setq deft-directory "~/git/phd/notes/"))
#+end_src

** Buffer, Frame and Window Configuration
*** Buffer Config
#+begin_src emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src
*** Frame Config
**** Frame Title
#+begin_src emacs-lisp
(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?  buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))
#+end_src
*** Window Config
**** Window Management
#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; Navigation
      "<left>"         #'evil-window-left
      "<down>"         #'evil-window-down
      "<up>"           #'evil-window-up
      "<right>"        #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)
#+end_src
**** Window Split
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below  t)

(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))

(setq +ivy-buffer-preview t)
#+end_src
**** Window Resize
#+begin_src emacs-lisp
(setq-default window-combination-resize t)
#+end_src

** Development
*** Productivity
**** Company
***** Company mode
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-numbers t))
#+end_src

***** Company Prescient
#+begin_src emacs-lisp
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src

** Org Mode
*** Basic Config
#+begin_src emacs-lisp
(setq-default major-mode 'org-mode)
(setq org-directory                     "~/git/phd/notes/"
      org-use-property-inheritance      t
      org-log-done                      'time
      org-list-allow-alphabetical       t
      org-catch-invisible-edits         'smart
      org-cycle-separator-lines              0)
#+end_src
*** Org-Capture
**** Templates
#+begin_src emacs-lisp

#+end_src
*** Org-Roam
**** Basic Config
#+begin_src emacs-lisp
(setq org-roam-directory        "~/git/phd/notes/")
(setq org-roam-db-update-method 'immediate)
#+end_src
**** Org Roam Bibtex
#+begin_src emacs-lisp
(use-package! org-roam-bibtex
  :after (org-roam)
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (setq orb-preformat-keywords
        '("citekey" "title" "url" "author-or-editor" "keywords" "file")
        orb-process-file-keyword t
        orb-file-field-extensions '("pdf"))
  (setq orb-templates
        '(("r" "ref" plain (function org-roam-capture--get-point)
           ""
           :file-name "${citekey}"
           :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}

- tags ::
- keywords :: ${keywords}

,* ${title}
:PROPERTIES:
:Custom_ID: ${citekey}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")
:NOTER_PAGE:
:END:"))))
#+end_src
*** Helm Bibtex
#+begin_src emacs-lisp
;(setq bibtex-format-citation-functions
;      '((org-mode . (lambda (x) (insert (concat
;                                         "\\cite{"
;                                         (mapconcat 'identity x ",")
;                                         "}")) ""))))


(setq
 bibtex-completion-notes-path   "~/git/phd/notes/"
 bibtex-completion-bibliography "~/Dropbox/org/research/zotLib.bib"
 bibtex-completion-library-path "~/Dropbox/org/research/zotero-library/"
 bibtex-completion-pdf-field    "file"
 bibtex-completion-notes-template-multiple-files
 (concat
  "#+TITLE: ${title}\n"
  "#+ROAM_KEY: cite:${=key=}\n"
  "#+ROAM_TAGS: ${keywords}\n"
  "* TODO Notes\n"
  ":PROPERTIES:\n"
  ":Custom_ID: ${=key=}\n"
  ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
  ":AUTHOR: ${author-abbrev}\n"
  ":JOURNAL: ${journaltitle}\n"
  ":DATE: ${date}\n"
  ":YEAR: ${year}\n"
  ":DOI: ${doi}\n"
  ":URL: ${url}\n"
  ":END:\n\n"))
#+end_src
*** Org Noter
#+begin_src emacs-lisp
(setq
 org-noter-hide-other nil
 org-noter-notes-search-path (list "~/git/phd/notes/"))
(map! :localleader
      :map (org-mode-map pdf-view-mode)
      (:prefix ("o" . "Org")
       (:prefix ("n" . "Noter")
        :desc "Noter" "n" 'org-noter)))
#+end_src
*** Pandoc
#+begin_src emacs-lisp
(use-package! ox-pandoc
  :after org)
;; default options for all output formats
(setq org-pandoc-options '((standalone . _)))
;; cancel above settings only for 'docx' format
(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special extensions for markdown_github output
(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
#+end_src
** Applications
*** PDF Tools
#+begin_src emacs-lisp
(after! pdf-view
  (setq-default pdf-view-display-size 'fit-width)
  (setq pdf-annot-activate-created-annotations t
        pdf-view-resize-factor 1.1))

(map!
 :map (pdf-view-mode-map)
 :n "g g"  #'pdf-view-first-page
 :n "G"    #'pdf-view-last-page
 :n "n"    #'pdf-view-next-page-command
 :n "N"    #'pdf-view-previous-page-command
 :localleader
 (:prefix "o"
  (:prefix "n"
   :desc "Insert Note" "n" 'org-noter-insert-note)))
#+end_src

